Autodesk.Revit.Creation.FamilyInstanceCreationData.RotateAngle
Get or set the rotate angle of the FamilyInstance
Remarks:  The FamilyInstance will rotate this angle when the instance is created.

Autodesk.Revit.Creation.FamilyInstanceCreationData.Axis
Get or set the axis of the FamilyInstance
Remarks:  The element property will be the axis while performing the rotation.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
adaptivePoints:  The adaptive points where the adaptive instance is to be initialized.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
face: A face of a geometry object.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
face: A face of a geometry object.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
referenceDirection:  A vector that dictates the direction of certain family instances.
host:  The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  The object into which the FamilyInstance is to be inserted, often known as the host.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  The object into which the FamilyInstance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
level:  A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
curve:  The curve where the instance is based.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
level:  A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Structure.StructuralType)
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType:  Specify if the family instance is structural.

Autodesk.Revit.Creation.FamilyInstanceCreationData
A class which wraps the arguments of FamilyInstance for batch creation.